// Lesson 17 Task 5

#include <iostream>
using namespace std;

int main()
{
	string str;
	cout << "Enter the text: \n";
	cin >> str;

	int len = str.length();
	cout << endl << len << endl;

}

//Напишите программу, которая запрашивает ввод с клавиатуры текста и подсчитывает количество слов в тексте,
//выводит полученное количество на экран.
//Пример работы программы :
//Входные данные :
//Мама мыла раму
//Выходные данные :
//3
